Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: **IMPORTANT**: Note that automatic registration is possible **only** for built-in registrars such as Consul, Eureka, and Static. If you're using a custom registrar, registration must still be handled programmatically. Check the `stork-programmatic-custom-registration-quickstart` link:{quickstarts-tree-url}/stork-programmatic-custom-registration-quickstart[directory] example for this use case.
ja_jp: **重要**: 自動登録は、Consul、Eureka、Static などの組み込みのレジストラに対して **のみ** 可能であることに注意してください。カスタムレジストラを使用している場合は、引き続きプログラムで登録を処理する必要があります。このユースケースについては、`stork-programmatic-custom-registration-quickstart` link:{quickstarts-tree-url}/stork-programmatic-custom-registration-quickstart[ディレクトリ] の例を確認してください。

source: **Individual acknowledgement** is the default strategy, an acknowledgement request is to the broker for each message.
ja_jp: **個別確認応答** は、デフォルトのストラテジーです。確認応答リクエストが各メッセージに対してブローカーに送信されます。

source: **JDK 24 or newer** is required for Leyden AOT features
ja_jp: Leyden AOT 機能には **JDK 24 以降** が必要です

source: **Jakarta CDI Compatibility**: Added no-args constructors for improved Jakarta CDI compatibility
ja_jp: **Jakarta CDI 互換性**: Jakarta CDI の互換性を向上させるために、引数なしのコンストラクターを追加しました。

source: **Java 24+ Change:** The `-Djdk.tracePinnedThreads` system property is **no longer available starting with Java 24**. This flag has been removed as part of the virtual thread improvements introduced in link:https://openjdk.org/jeps/491[JEP 491]. For Java 24+, use the JFR (Java Flight Recorder) events or the Quarkus testing extensions described below to detect pinning.
ja_jp: **Java 24+ の変更点:** `-Djdk.tracePinnedThreads` システムプロパティーは、**Java 24 以降では利用できなくなりました**。このフラグは、link:https://openjdk.org/jeps/491[JEP 491] で導入された仮想スレッドの改善の一部として削除されました。Java 24+ の場合、JFR (Java Flight Recorder) イベント、または以下で説明する Quarkus テストエクステンションを使用してピニングを検出してください。

source: **Java 24+ Improvement:** Starting with Java 24, thanks to link:https://openjdk.org/jeps/491[JEP 491: Synchronize Virtual Threads without Pinning], `synchronized` blocks and methods **no longer cause pinning**. This is a major improvement that eliminates one of the most common pinning scenarios. However, native code interactions can still cause pinning (see below).
ja_jp: **Java 24+ の改善点:** Java 24 以降、link:https://openjdk.org/jeps/491[JEP 491: Synchronize Virtual Threads without Pinning] のおかげで、`synchronized` ブロックとメソッドは **ピニングを引き起こさなくなりました**。 これは、最も一般的なピニングのシナリオの1つを排除する大きな改善です。 ただし、ネイティブコードとのやり取りは依然としてピニングを引き起こす可能性があります (以下を参照)。

source: **K8sCelValidatorResource** - Provides REST API endpoint
ja_jp: **K8sCelValidatorResource** - REST API エンドポイントを提供

source: **K8sCelValidatorService** - Manages WASM integration and business logic
ja_jp: **K8sCelValidatorService** - WASM 統合とビジネスロジックを管理

source: **Kotlin users** can use a data class annotated with `@JvmRecord` to achieve the same result:
ja_jp: **Kotlin ユーザー**は、`@JvmRecord` でアノテーションされたデータクラスを使用して、同じ結果を得ることができます。

source: **Leading slashes in explicitly configured values matter.** We know some of you want to move endpoints to specific places, and the most consistent way to express that intent is to allow you to specify the exact uri you want an endpoint to use. If you specify `/metrics`, that is where you will find the metrics endpoint.
ja_jp: **明示的に設定された値の先頭のスラッシュは重要です。** エンドポイントを特定の場所に移動させたいと考えている人がいることは承知しており、その意図を表現する最も一貫した方法は、エンドポイントに使用させたい URI を正確に指定できるようにすることです。 `/metrics` を指定すると、それがメトリクス・エンドポイントを見つける場所になります。

source: **Made for an asynchronous world** - Mutiny can be used in any asynchronous application such as event-driven microservices, message-based applications, network utilities, data stream processing, and of course... reactive applications!
ja_jp: **非同期の世界のために作られた** - Mutinyは、イベントドリブンなマイクロサービス、メッセージベースのアプリケーション、ネットワークユーティリティ、データストリーム処理、そしてもちろんリアクティブなアプリケーションなど、あらゆる非同期アプリケーションで使用することができます。

source: **Menu**: Add pages to the Dev UI's left-hand menu.
ja_jp: **メニュー**: Dev UI の左側メニューにページを追加します。

source: **MicroProfile Config**: Added missing `META-INF/beans.xml` to the microprofile-config integration
ja_jp: **MicroProfile Config**: microprofile-config 統合に欠落していた `META-INF/beans.xml` を追加しました。

source: **Navigable** - Even with intelligent code completion, classes with hundreds of methods are confusing. Mutiny provides a navigable and explicit API driving you towards the operator you need.
ja_jp: **Navigable** - インテリジェントなコード補完機能があっても、何百ものメソッドを持つクラスは混乱します。Mutinyは、必要な演算子に向かってあなたを導く、ナビゲーブルで明示的なAPIを提供します。

source: **New applications (no existing v2 messages):** No configuration needed. The v3 defaults will be used automatically.
ja_jp: *新規アプリケーション (既存の v2 メッセージなし):* 設定は不要です。v3 のデフォルトが自動的に使用されます。

source: **New topic migration:** Create a new v3 topic and migrate traffic to it
ja_jp: *新規トピック移行:* 新しい v3 トピックを作成し、トラフィックをそちらに移行

source: **Next-Generation Networking:** We are exploring the adoption of HTTP/3, leveraging its multiplexing and reduced head-of-line blocking to further minimize latency and boost the throughput of metadata requests, which is crucial for query engines managing thousands of concurrent operations.
ja_jp: **次世代ネットワーキング:** HTTP/3の採用を検討しており、その多重化とヘッドオブラインブロッキングの削減を活用して、メタデータリクエストのレイテンシーをさらに最小限に抑え、スループットを向上させます。これは、数千の同時操作を管理するクエリーエンジンにとって不可欠です。

source: **Non-Blocking I/O** - Mutiny is the perfect companion to tame the asynchronous nature of applications with non-blocking I/O (which powers xref:quarkus-reactive-architecture.adoc[Quarkus]). Declaratively compose operations, transform data, enforce progress, recover from failures, and more.
ja_jp: **ノンブロッキングI/O** - Mutinyは、ノンブロッキングI/O（ link:quarkus-reactive-architecture.html[Quarkus]の動力源）を備えたアプリケーションの非同期性を制御するための完璧なコンパニオンです。宣言的にオペレーションを構成し、データを変換し、進行を強制し、障害から回復するなどの機能があります。

source: **Note**: All the configuration options in this guide are available on both OpenShift and Kubernetes. The rest of the guide will use Kubernetes(`quarkus.kubernetes` prefix) configuration prefix, but all the configuration options are also available for OpenShift(`quarkus.openshift` prefix) too.
ja_jp: *注意* : このガイドのすべての設定オプションは、OpenShiftとKubernetesの両方で利用可能です。残りのガイドではKubernetes( `quarkus.kubernetes` prefix)の設定プレフィックスを使用しますが、すべての設定オプションはOpenShift( `quarkus.openshift` prefix)でも使用できます。

source: **Note**: In this context globally means `for all extensions that support init task externalization`.
ja_jp: **注**: この文脈では、グローバルとは、 `初期化タスクの外部化をサポートする全てのエクステンションに対して` を意味します。

source: **Note**: The application, the init container and the job use the same `ServiceAccount` and therefore, share the same permissions.
ja_jp: *注意* : アプリケーション、init コンテナー、ジョブは同じ `ServiceAccount` を使用するため、同じパーミッションを共有します。

source: **Null-Safety**: Migrated the spec module to use JSpecify annotations for better null-safety guarantees
ja_jp: **Null 安全性**: spec モジュールを JSpecify アノテーションを使用するように移行し、より優れた Null 安全性を保証しました。

source: **Optimistic fallback handler:** Use the `OptimisticFallbackIdHandler` for gradual migration (see below)
ja_jp: *Optimistic フォールバックハンドラー:* 段階的な移行には `OptimisticFallbackIdHandler` を使用します (以下を参照)。

source: **Optimized Resource Consumption**: The combination of build-time optimization and reactive architecture results in lower CPU requirements, directly reducing cloud costs for organizations running Polaris at scale.
ja_jp: **最適化されたリソース消費**: ビルド時最適化とリアクティブアーキテクチャの組み合わせにより、CPU 要件が低減され、Polaris を大規模に運用する組織のクラウドコストを直接削減します。

source: **Optional:** In a non-production environment only and purely for testing Quarkus Security in your applications:
ja_jp: **オプション:** 非実稼働環境のみで、アプリケーションで Quarkus セキュリティーをテストする場合:

source: **Pages**: Fixed-size portions of a chunk (usually 8KB).
ja_jp: **ページ**: チャンクの固定サイズ部分 (通常は8KB)。

source: **Password hashing best practices:**
ja_jp: *パスワードハッシュのベストプラクティス:*

source: **Password**: `admin`
ja_jp: **パスワード**: `admin`

source: **Problem of the day:** to ensure binary compatibility, the Hub4j GitHub API introduces some bridge methods that confuse Mockito and more specifically ByteBuddy and ultimately make our tests unreliable. How can we solve that?
ja_jp: **今日の問題:** バイナリ互換性を確保するために、Hub4j GitHub APIは、Mockito、特にByteBuddyを混乱させ、最終的に我々のテストの信頼性を低下させるいくつかのブリッジ・メソッドを導入しています。どうすればそれを解決できるでしょうか？

source: **Producing v2-compatible messages:** If downstream consumers still use v2, configure the producer:
ja_jp: *v2 互換メッセージの生成:* ダウンストリームのコンシューマーがまだ v2 を使用している場合は、プロデューサーを設定します。

source: **Protocol Alignment**: Updated the A2A protocol implementation to align with the latest specification revision, including updates to the gRPC protocol definitions.
ja_jp: **プロトコルの整合性**: gRPC プロトコル定義の更新を含む、最新の仕様改訂に合わせるために A2A プロトコルの実装を更新しました。

source: **Reactive Streams and Converters Built-In** - Mutiny is based on the https://www.reactive-streams.org/[Reactive Streams] specification, and so it can be integrated with any other reactive programming library. In addition, it proposes converters to interact with other popular libraries.
ja_jp: **Reactive Streamsとコンバータ内蔵** - Mutinyは link:https://www.reactive-streams.org/[Reactive Streams]の仕様に基づいているため、他のリアクティブプログラミングライブラリと統合することができます。さらに、他のポピュラーなライブラリと対話するためのコンバータも提供しています。

source: **Reads** both 4-byte (v3) and 8-byte (v2) IDs
ja_jp: 4バイト (v3) と 8バイト (v2) の両方の ID を **読み取ります**

source: **Redpanda** is a Kafka compatible event streaming platform. Because it provides a fast startup times, Dev Services defaults to Redpanda images from `redpandadata/redpanda`. You can select any version from https://hub.docker.com/r/redpandadata/redpanda.
ja_jp: *Redpanda* は Kafka 互換のイベントストリーミングプラットフォームです。高速な起動時間を提供するため、Dev Services はデフォルトで `redpandadata/redpanda` からの Redpanda イメージを使用します。 https://hub.docker.com/r/redpandadata/redpanda から任意のバージョンを選択できます。

source: **Redpanda** is a Kafka compatible event streaming platform. Because it provides a fast startup times, dev services defaults to Redpanda images from `vectorized/redpanda`. You can select any version from https://hub.docker.com/r/vectorized/redpanda.
ja_jp: RedpandaはKafkaと互換性のあるイベントストリーミングプラットフォームです。 起動時間が高速な為、dev services はデフォルトで `vectorized/redpanda` のRedpandaイメージを使用します。 https://hub.docker.com/r/vectorized/redpanda から任意のバージョンを選択することができます。

source: **Reduced Memory Footprint**: The reactive core uses a small number of event loops instead of maintaining large thread pools, dramatically reducing memory usage and enabling higher deployment density.
ja_jp: **メモリフットプリントの削減**: リアクティブコアは、大規模なスレッドプールを維持するのではなく、少数のイベントループを使用することで、メモリ使用量を劇的に削減し、より高いデプロイ密度を可能にします。

source: **Response**: Returns user details as a JSON object derived from the token.
ja_jp: **レスポンス**: トークンから派生した JSON オブジェクトとしてユーザーの詳細を返します。

source: **Self-signed certificate**: The certificate is signed by the same entity that uses it. It is not trusted by default. This type of certificate is typically used when a Certificate Authority (CA) is unavailable or when a simple setup is needed. It is not suitable for production and is intended only for development.
ja_jp: **自己署名証明書**: この証明書は、それを使用するエンティティーと同じエンティティーによって署名されます。 デフォルトでは信頼されません。 このタイプの証明書は、通常、認証局 (CA) が利用できない場合や、簡単なセットアップが必要な場合に使用されます。 実稼働環境には適しておらず、開発目的でのみ使用する必要があります。

source: **Self-signed certificate**: The certificate is signed by the same entity that uses it. It is not trusted by default. This type of certificate is typically used when a Certificate Authority (CA) is unavailable or you want a simple setup. It is not suitable for production and should only be used for development.
ja_jp: **自己署名証明書**: 証明書は、それを使用するエンティティーと同じエンティティーによって署名されます。 デフォルトでは信頼されません。 このタイプの証明書は、通常、認証局 (CA) が利用できない場合や、簡単なセットアップが必要な場合に使用されます。 実稼働環境には適しておらず、開発目的でのみ使用する必要があります。

source: **Self-signed certificate**: The owner signs the certificate with their own key. Clients do not trust this certificate by default. Use this certificate when a Certificate Authority (CA) is not available or when you need a simple setup. It is not suitable for production and is intended only for development.
ja_jp: **自己署名証明書**: 所有者が自身の鍵で証明書に署名します。クライアントはデフォルトでこの証明書を信頼しません。認証局 (CA) が利用できない場合や、簡単なセットアップが必要な場合に使用してください。実稼働環境には適しておらず、開発目的のみを意図しています。

source: **Settings**: Add a tab to the settings dialog
ja_jp: **設定**: 設定ダイアログにタブを追加します。

source: **Simplified Maintenance**: Reduce the need to update and redeploy applications when access policies change.
ja_jp: **メンテナンスの簡素化**: アクセスポリシーが変更されたときにアプリケーションを更新して再デプロイする必要性を軽減します。

source: **Startup** and **Readiness** probes for both inbound and outbound channels report *OK* when the connection with the broker is established.
ja_jp: 着信チャネルと発信チャネルの **Startup** および **Readiness** プローブは、ブローカーとの接続が確立されると、*OK* を報告します。

source: **Stop and drain:** Stop producers → drain topic completely → upgrade all services → restart with v3 configuration
ja_jp: *停止とドレイン:* プロデューサーを停止 → トピックを完全にドレイン → すべてのサービスをアップグレード → v3 設定で再起動

source: **Strimzi** provides container images and Operators for running Apache Kafka on Kubernetes. While Strimzi is optimized for Kubernetes, the images work perfectly in classic container environments. Strimzi container images run "genuine" Kafka broker on JVM, which is slower to start.
ja_jp: **Strimzi** は、Kubernetes上でApache Kafkaを動作させるためのコンテナイメージとOperatorを提供します。 StrimziはKubernetesに最適化されていますが、イメージは従来のコンテナ環境でも完全に動作します。 Strimziのコンテナイメージは、JVM上で “純正の” Kafkaブローカーを動作させますが、起動が遅くなっています。

source: **Subpages**: Smaller allocations within a page for tiny objects.
ja_jp: **サブページ**: 小さいオブジェクト用のページ内のより小さな割り当て。

source: **TL;DR:** As of `1.11.5.Final` and `1.12.1.Final`, leading slashes matter in config. So if you use `/endpoint`, that endpoint will be served from the absolute root. If you want it relative to some containing bucket, omit that leading slash. For example, `quarkus.http.non-application-root-path` is now `q` by default, which nests it under `quarkus.http.root-path`, matching the original behavior. You can use an absolute path, e.g. `/q`, to serve non-application endpoints from the absolute root (as a sibling of the http root, if that is set). To remove the non-application endpoint behavior entirely, set `quarkus.http.non-application-root-path` to the same value as `quarkus.http.root-path`. The most foolproof way to do this is using a variable: `quarkus.http.non-application-root-path=${quarkus.http.root-path}`.
ja_jp: **TL;DR:** `1.11.5.Final` と `1.12.1.Final` の時点では、設定における先頭のスラッシュは重要です。つまり、 `/endpoint` を使用した場合、そのエンドポイントは絶対ルートから提供されます。もし、包含するバケットからの相対的なものにしたいのであれば、先頭のスラッシュを省略してください。例えば、 `quarkus.http.non-application-root-path` はデフォルトでは `q` になり、 `quarkus.http.root-path` の下に入れ子になり、元の動作と一致します。アプリケーション以外のエンドポイントを絶対ルートから (設定されている場合は http ルートの兄弟として) 提供するために、例えば `/q` のような絶対パスを使うことができます。アプリケーション以外のエンドポイントの動作を完全に削除するには、 `quarkus.http.non-application-root-path` を `quarkus.http.root-path` と同じ値に設定します。これを行う最も簡単な方法は、変数を使用することです: `quarkus.http.non-application-root-path=${quarkus.http.root-path}`.

source: **TL;DR:** We have a whole new set of more granular BOMs that you can use instead of the big `quarkus-universe-bom`. We have deployed a registry service that aligns and manages platform compatibility across these more granular BOMs and our tools (maven, gradle and CLI) know how to work with this registry to simplify the discovery of extensions that work with your project.
ja_jp: **TL;DR:** `quarkus-universe-bom` のような大きなBOMではなく、より詳細なBOMのセットを用意しました。これらのより詳細なBOM間でプラットフォームの互換性を調整および管理するレジストリサービスを用意しました。また、maven、gradle、CLIなどのツールは、このレジストリとの連携方法を知っており、プロジェクトで動作するエクステンションの発見を容易にします。

source: **The "Base" codestarts (you choose a combination of those):**
ja_jp: **"ベース" のコードスタート（この組み合わせを選択）:**

source: **Thread-local Caches**: Per-thread cache for frequently used small buffers, reducing contention.
ja_jp: **スレッドローカルキャッシュ**: 頻繁に使用される小さなバッファー用のスレッドごとのキャッシュで、競合を軽減します。

source: **Trust**: The microservice must trust the issuing Keycloak server.
ja_jp: **信頼**: マイクロサービスは発行元の Keycloak サーバーを信頼する必要があります。

source: **Unlisted**: Pages that are not listed anywhere above, but are added to the router and can be linked to.
ja_jp: **未掲載**: 上記のどこにもリストされていませんが、ルーターに追加され、リンクできるページ。

source: **User identifiers**: Indicating the subject (user) for whom the token was issued.
ja_jp: **ユーザー識別子**: トークンが発行された対象 (ユーザー) を示します。

source: **Username**: `admin`
ja_jp: **ユーザー名**: `admin`

source: **Valid token**: The token must have a correct signature, a valid expiration date, and the appropriate audience.
ja_jp: **有効なトークン**: トークンには正しい署名、適切な有効期限、適切な対象者が設定されている必要があります。

source: **Warning:** This is potentially dangerous. Users should only do this if they understand the reactive model, and are aware that writing directly to the response can bypass normal handling of status codes, headers, and serialization.
ja_jp: **警告:** これは潜在的に危険です。ユーザーは、リアクティブモデルを理解し、レスポンスに直接書き込むことがステータスコード、ヘッダー、およびシリアライゼーションの通常の処理をバイパスする可能性があることを認識している場合にのみ、これを行うべきです。

source: **With all these optimizations, the time spent in the various goals of the `quarkus-maven-plugin` was cut in half compared to our reference version, 3.25.1.** That's great... but building our sample application still took around two minutes, which is more than we would like.
ja_jp: **これらすべての最適化により、`quarkus-maven-plugin` の様々なゴールに費やされる時間は、参照バージョン3.25.1と比較して半分に短縮されました。** これは素晴らしいことですが、サンプルアプリケーションのビルドには依然として約2分かかり、これは望ましい時間よりも長いです。

source: **With standard ID handlers, gradual migration only works when:**
ja_jp: *標準 ID ハンドラーを使用する場合、段階的な移行が機能するのは以下の場合のみです。*

source: **Writes** new messages with 4-byte (v3) IDs
ja_jp: 4バイト (v3) の ID を持つ新しいメッセージを **書き込みます**

source: **You need to build your codestart with Maven to make it available in the tooling:**
ja_jp: **ツールで利用できるようにするには、Mavenでcodestartをビルドする必要があります：**

source: **kafka-native** provides images of standard Apache Kafka distribution compiled to native binary using Quarkus and GraalVM. While still being _experimental_, it provides very fast startup times with small footprint.
ja_jp: **kafka-native** はQuarkusとGraalVMを使用してネイティブバイナリにコンパイルされた通常のApache Kafkaディストリビューションのイメージを提供します。 まだ _experimental_ ですが、非常に高速な起動時間と小さなフットプリントを提供します。

source: *-Lead Developer on the Adoptium Technical Steering Committee*
ja_jp: *-Adoptium Technical Steering Committeeのリードデベロッパー*

source: *30 minutes later...*
ja_jp: *30分後...*

source: *Access policy*: Restricted to users with a valid bearer token and the `admin` role.
ja_jp: *アクセスポリシー*: 有効なベアラートークンと `admin` ロールを持つユーザーに制限されます。

source: *AgentCard evolution*: The `AgentCard` now uses a `supportedInterfaces` list instead of separate `url`, `preferredTransport`, and `additionalInterfaces` fields. This provides a cleaner, more flexible way to advertise multiple protocol bindings.
ja_jp: *AgentCardの進化*: `AgentCard` は、個別の `url`、`preferredTransport`、`additionalInterfaces` フィールドの代わりに、`supportedInterfaces` リストを使用するようになりました。これにより、複数のプロトコルバインディングを宣伝するための、よりクリーンで柔軟な方法が提供されます。

source: *AgentCard structure*: Replace `url` + `preferredTransport` with `supportedInterfaces` list
ja_jp: *AgentCard構造*: `url` + `preferredTransport` を `supportedInterfaces` リストに置き換える

source: *All data collected is anonymous*. There is no way to link this data back to an individual or organization. The intent is to learn about general patterns and trends; therefore, only anonymous data is needed.
ja_jp: *収集されたデータはすべて匿名です。* このデータを個人や組織に結びつける方法はありません。一般的なパターンや傾向を知ることが目的であるため、匿名のデータのみが必要です。

source: *Augmentation*. During the build time, the Quarkus extensions will load and scan your application's bytecode (including the dependencies) and configuration. At this stage, the extension can read configuration files, scan classes for specific annotations, etc. Once all the metadata has been collected, the extensions can pre-process the libraries bootstrap actions like your ORM, DI or REST controllers configurations. The result of the bootstrap is directly recorded into bytecode and will be part of your final application package.
ja_jp: *拡張 (Augmentation)*。ビルド時に、Quarkus エクステンションはアプリケーションのバイトコード (依存関係を含む) と設定をロードしてスキャンします。 この段階で、エクステンションは設定ファイルを読み込んだり、特定のアノテーションのためにクラスをスキャンしたりすることができます。 すべてのメタデータが収集されたら、エクステンションは、ORM、DI、または REST コントローラーの設定のようなライブラリーのブートストラップアクションを前処理することができます。 ブートストラップの結果はバイトコードに直接記録され、最終的なアプリケーションパッケージの一部となります。

source: *Augmentation*. During the build time, the Quarkus extensions will load and scan your application's bytecode (including the dependencies) and configuration. At this stage, the extension can read configuration files, scan classes for specific annotations, etc. Once all the metadata has been collected, the extensions can pre-process the libraries bootstrap actions like your ORM, DI, or REST controllers configurations. The result of the bootstrap is directly recorded into bytecode and will be part of your final application package.
ja_jp: *オーグメンテーション*。ビルド時に、Quarkus エクステンションはアプリケーションのバイトコード (依存関係を含む) と設定をロードしてスキャンします。この段階で、エクステンションは設定ファイルを読み込んだり、特定の アノテーション のためにクラスをスキャンしたりできます。すべてのメタデータが収集されると、エクステンションは ORM、DI、または REST コントローラー設定のようなライブラリーのブートストラップアクションを前処理できます。ブートストラップの結果はバイトコードに直接記録され、最終的なアプリケーションパッケージの一部となります。

source: *Better validation*: Enhanced input validation across all transports
ja_jp: *より良い検証*: すべてのトランスポートで入力検証を強化しました

source: *Brief:* Is no more than three sentences long.
ja_jp: *概要:* 3 文以内にします。

source: *Build Metrics*
ja_jp: *ビルドメトリクス*

source: *Build time analytics is not active by default.*
ja_jp: *ビルド時解析はデフォルトではアクティブになっていません。*

source: *Builder pattern*: Use `AgentCard.builder()` instead of `new AgentCard.Builder()` - applies to all spec classes
ja_jp: *ビルダーパターン*: `new AgentCard.Builder()` の代わりに `AgentCard.builder()` を使用する — すべての仕様クラスに適用されます

source: *By using PEM files:*
ja_jp: *PEM ファイルを使用する場合:*

source: *By using a `p12` (PKCS12) keystore:*
ja_jp: *`p12` (PKCS12) キーストアを使用する場合:*

source: *Caching Efficiency:* Server-side rendering allows for result caching, which can be reused across users and subsequent requests. This optimizes performance and lowers costs by reducing rendering and data fetching per request.
ja_jp: *キャッシュの効率:* サーバー側レンダリングにより結果をキャッシュできるため、ユーザー間および後続のリクエスト間で再利用できます。これにより、リクエストごとのレンダリングとデータ取得が削減され、パフォーマンスの最適化およびコスト削減が実現できます。

source: *Classic Maven publication*
ja_jp: *クラッシックMaven publication*

source: *Client keystore*: Contains the client's certificate and private key.
ja_jp: *クライアントのキーストア*: クライアントの証明書と秘密鍵が格納されます。

source: *Client truststore*: Stores the server's certificate for authenticating the server.
ja_jp: *クライアントのトラストストア*: サーバーを認証するためのサーバーの証明書が保存されます。

source: *Collection happens only at build-time* and not at runtime. Collection occurs during usage of Quarkus build tooling (Maven, Gradle). Your built application does not contain any data collection code.
ja_jp: *収集はビルド時にのみ行われます* 、実行時には行われません。収集は、Quarkusのビルドツール（Maven、Gradle）の使用中に行われます。ビルドされたアプリケーションには、データ収集コードは含まれません。

source: *Collection is disabled by default* You will be asked if you want to opt in to data collection the first time you use dev mode. The console will wait for a few seconds for your input.
ja_jp: *収集はデフォルトで無効になっています。* 最初にdevモードを使用するときに、データ収集に参加するかどうか尋ねられます。コンソールはあなたの入力を数秒間待ちます。

source: *Compose Dev Services* extends the Dev Services concept by allowing you to define custom dev services using the https://compose-spec.io/[Compose specification]. _The Compose Specification is a developer-focused standard for defining cloud and platform agnostic container-based applications_.
ja_jp: *Compose Dev Services* は、link:https://compose-spec.io/[Compose Specification] を使用してカスタムの dev services を定義できるようにすることで、Dev Services の概念を拡張します。_Compose Specification は、クラウドとプラットフォームに依存しないコンテナーベースのアプリケーションを定義するための、開発者向けの標準です_。

source: *Concise:* Avoids self-referential expressions and filler words, for example:
ja_jp: *簡潔である:* 例えば、自己言及的な表現、フィラーワードを避ける。例:

source: *Configuration*
ja_jp: *設定*

source: *Continuous Testing*
ja_jp: *継続的テスト*

source: *D* - deprecated
ja_jp: *D* - 非推奨
